Repository: nagyist/neoscms-neos-ui
Catalog: Resources/Private/Translations/*/Main.xlf
Languages: fi

# copy__from__to--title
source: Copy {source} to {target}
fi: Kopioi {source} kohteeseen {target}

# move__from__to--title
source: Move {source} to {target}
fi: Siirrä {source} kohteeseen {target}

# copy__from__to--description
source: Please select the position at which you want {source} inserted relative to {target}.
fi: Valitse sijainti, johon haluat lisätä {source}:n suhteessa kohteeseen {target}.

source: Insert
fi: Lisää

source: Insert mode
fi: Lisää-tila

# imageCropper__aspect-ratio-placeholder
source: Choose an Aspect Ratio
fi: Valitse kuvasuhde

# ckeditor__toolbar__bold
source: Bold
fi: Lihavoitu

# ckeditor__toolbar__italic
source: Italic
fi: Kursiivi

# ckeditor__toolbar__underline
source: Underline
fi: Alleviivaa

# ckeditor__toolbar__subscript
source: Subscript
fi: Aliskripti

# ckeditor__toolbar__superscript
source: Superscript
fi: Superskripti

# ckeditor__toolbar__strikethrough
source: Strikethrough
fi: Yliviivattu

# ckeditor__toolbar__link
source: Link
fi: Linkki

# ckeditor__toolbar__unlink
source: Unlink
fi: Pura linkitys

# ckeditor__toolbar__link__hideOptions
source: Hide link options
fi: Piilota linkkivaihtoehdot

# ckeditor__toolbar__link__showOptions
source: Link options
fi: Linkkivaihtoehdot

# ckeditor__toolbar__link__noFollow
source: No follow
fi: Ei seuraa

# ckeditor__toolbar__link__targetBlank
source: Open in new window
fi: Avaa uuteen ikkunaan

# ckeditor__toolbar__link__titlePlaceholder
source: Enter link title
fi: Syötä linkin otsikko

# ckeditor__toolbar__link__title
source: Title
fi: Otsikko

# ckeditor__toolbar__link__anchorPlaceholder
source: Enter anchor name
fi: Syötä ankkurin nimi

# ckeditor__toolbar__link__anchor
source: Link to anchor
fi: Luo linkki ankkuriin

# ckeditor__toolbar__link__edit
source: Edit link
fi: Muokkaa linkkiä

# ckeditor__toolbar__link__apply
source: Apply link
fi: Ota linkki käyttöön

# ckeditor__toolbar__link__placeholder
source: Paste a link, or search
fi: Liitä linkki tai hae

# ckeditor__toolbar__link__formatAsHttp
source: Format as http link?
fi: Muotoillaanko HTTP-linkiksi?

# ckeditor__toolbar__link__formatAsEmail
source: Format as email?
fi: Muotoillaanko sähköpostiksi?

# ckeditor__toolbar__ordered-list
source: Ordered list
fi: Tilattu lista

# ckeditor__toolbar__unordered-list
source: Unordered list
fi: Järjestämätön lista

# ckeditor__toolbar__align-left
source: Align left
fi: Tasaa vasemmalle

# ckeditor__toolbar__align-right
source: Align right
fi: Tasaa oikealle

# ckeditor__toolbar__align-center
source: Align center
fi: Tasaa keskelle

# ckeditor__toolbar__align-justify
source: Align justify
fi: Tasaa tasaus

# ckeditor__toolbar__table
source: Table
fi: Taulukko

# ckeditor__toolbar__tableColumn
source: Column
fi: Sarake

# ckeditor__toolbar__tableRow
source: Row
fi: Rivi

# ckeditor__toolbar__tableMergeCells
source: Merge cells
fi: Yhdistä solut

# ckeditor__toolbar__remove-format
source: Remove format
fi: Poista muoto

# ckeditor__toolbar__outdent
source: Outdent
fi: Uloslommo

# ckeditor__toolbar__indent
source: Indent
fi: Sisennä

# ckeditor__toolbar__setTableColumnHeader
source: Header column
fi: Otsikkosarake

# ckeditor__toolbar__insertTableColumnLeft
source: Insert column before
fi: Lisää sarake ennen

# ckeditor__toolbar__insertTableColumnRight
source: Insert column after
fi: Lisää sarake perään

# ckeditor__toolbar__removeTableColumn
source: Delete column
fi: Poista sarake

# ckeditor__toolbar__setTableRowHeader
source: Header row
fi: Otsikkorivi

# ckeditor__toolbar__insertTableRowBelow
source: Insert row below
fi: Lisää rivi alle

# ckeditor__toolbar__insertTableRowAbove
source: Insert row above
fi: Lisää rivi ylle

# ckeditor__toolbar__removeTableRow
source: Delete row
fi: Poista rivi

# ckeditor__toolbar__mergeTableCellUp
source: Merge cell up
fi: Yhdistä solu ylös

# ckeditor__toolbar__mergeTableCellRight
source: Merge cell right
fi: Yhdistä solu oikealle

# ckeditor__toolbar__mergeTableCellDown
source: Merge cell down
fi: Yhdistä solu alas

# ckeditor__toolbar__mergeTableCellLeft
source: Merge cell left
fi: Yhdistä solu vasemmalle

# ckeditor__toolbar__splitTableCellVertically
source: Split cell vertically
fi: Jaa solu pystysuunnassa

# ckeditor__toolbar__splitTableCellHorizontally
source: Split cell horizontally
fi: Jaa solu vaakasuunnassa

source: Create new
fi: Luo uusi

source: No matches found
fi: Osumia ei löytynyt

# searchBoxLeftToType
source: Please enter ###CHARACTERS### more character
fi: Syötä ###MERKIT### lisää merkkiä

# Shortcut__Introduction
source: These are Keyboard-Shortcuts we are providing. You have to press the keys on the right after each other. They will not get triggered when you are focusing an input field.
fi: Nämä ovat tarjoamiamme pikanäppäimiä. Sinun on painettava oikealla olevia näppäimiä toistensa jälkeen. Ne eivät laukea, kun tarkennat syöttökenttää.

# Shortcut__UI.RightSideBar.toggle
source: Toggle inspector
fi: Näytä/piilota tarkastelu

# Shortcut__UI.FullScreen.toggle
source: Toggle full screen
fi: Koko näyttö päälle/pois

# Shortcut__UI.LeftSideBar.toggle
source: Toggle left sidebar
fi: Vaihda vasenta sivupalkkia

# Shortcut__UI.LeftSideBar.toggleContentTree
source: Toggle contenttree
fi: Vaihda sisältöpuuta

# Shortcut__UI.AddNodeModal.close
source: Close Add-Node-Modal
fi: Sulje Lisää-Solmu-Modaalinen

# Shortcut__UI.Drawer.toggle
source: Toggle Drawer
fi: Vaihda laatikkoa

# Shortcut__UI.EditModePanel.toggle
source: Toggle EditModePanel
fi: Vaihda MuokkaustilanPaneeli

# Shortcut__UI.InsertionModeModal.cancel
source: Cancel InsertionModeModal
fi: Peruuta lisäystilan modaali

# Shortcut__UI.InsertionModeModal.apply
source: Apply InsertionModeModal
fi: Ota InsertionModeModal käyttöön

# Shortcut__UI.ContentCanvas.reload
source: Reload ContentCanvas
fi: Lataa ContentCanvas uudelleen

# Shortcut__UI.Inspector.discard
source: Discard Inspector
fi: Hylkää tarkastaja

# Shortcut__UI.Inspector.escape
source: Escape Inspector
fi: Pakene tarkastajaa

# Shortcut__UI.Inspector.resume
source: Resume Inspector
fi: Jatka tarkastaja

# Shortcut__UI.NodeCreationDialog.back
source: NodeCreationDialog Back
fi: NodeCreationDialog Takaisin

# Shortcut__UI.NodeCreationDialog.cancel
source: NodeCreationDialog Cancel
fi: NodeCreationDialog Peruuta

# Shortcut__UI.NodeCreationDialog.apply
source: NodeCreationDialog Apply
fi: NodeCreationDialog Sovella

# Shortcut__UI.NodeVariantCreationDialog.cancel
source: NodeVariantCreationDialog Cancel
fi: NodeVariantCreationDialog Peruuta

# Shortcut__UI.NodeVariantCreationDialog.createEmpty
source: NodeVariantCreationDialog Create Empty
fi: NodeVariantCreationDialog Luo tyhjä

# Shortcut__UI.NodeVariantCreationDialog.createAndCopy
source: NodeVariantCreationDialog Create and Copy
fi: NodeVariantCreationDialog Luo ja kopioi

# Shortcut__CR.Nodes.unfocus
source: Unfocus Node
fi: Keskittymätön solmu

# changesApplied[0]
source: {0} change successfully applied.
fi: {0} muutos otettu käyttöön.

# changesApplied[1]
source: {0} changes successfully applied.
fi: {0} muutosta otettu käyttöön.

# changesPublished[0]
source: Published {0} change to "{1}".
fi: Julkaistu {0} muutos kohteeseen "{1}".

# changesPublished[1]
source: Published {0} changes to "{1}".
fi: Julkaistu {0} muutosta kohteeseen "{1}".

# changesDiscarded[0]
source: Discarded {0} change.
fi: Hylätty {0} muutos.

# changesDiscarded[1]
source: Discarded {0} changes.
fi: Hylätty {0} muutosta.

# workspaceContainsUnpublishedChanges
source: Your personal workspace currently contains unpublished changes. In order to switch to a different target workspace you need to either publish or discard pending changes first.
fi: Henkilökohtainen työtilasi sisältää tällä hetkellä julkaisemattomia muutoksia. Jos haluat vaihtaa toiseen kohdetyötilaan, sinun on ensin joko julkaistava tai hylättävä odottavat muutokset.

# errorBoundary.reloadUi
source: Reload Neos UI
fi: Lataa Neos-käyttöliittymä uudelleen

# errorBoundary.title
source: Sorry, but the Neos UI could not recover from this error.
fi: Anteeksi, mutta Neos-käyttöliittymä ei voinut toipua tästä virheestä.

source: Above
fi: Yllä

# InsertModeTitleAfter
source: below
fi: alla

source: Inside
fi: Sisällä

# InsertModeTitleInto
source: inside
fi: sisällä

# InsertModeTitleBefore
source: above
fi: yllä

source: Below
fi: Alla

# ckeditor__toolbar__style__p
source: Paragraph
fi: Kappale

# ckeditor__toolbar__style__h1
source: Headline 1
fi: Otsikko 1

# ckeditor__toolbar__style__h2
source: Headline 2
fi: Otsikko 2

# ckeditor__toolbar__style__h3
source: Headline 3
fi: Otsikko 3

# ckeditor__toolbar__style__h4
source: Headline 4
fi: Otsikko 4

# ckeditor__toolbar__style__h5
source: Headline 5
fi: Otsikko 5

# ckeditor__toolbar__style__h6
source: Headline 6
fi: Otsikko 6

# ckeditor__toolbar__style__blockquote
source: Blockquote
fi: Lohkolainaus

# ckeditor__toolbar__link__download
source: Downloadable
fi: Ladattavissa

# NodeNotPublishedMissingParentNode
source: Node could not be published, probably because of a missing parentNode. Please check that the parentNode has been published.
fi: Solmua ei voitu julkaista, luultavasti puuttuvan vanhempisolmun takia. Tarkista, että parentNode on julkaistu.

# NodeNotPublishedParentNodeNotInCurrentDimension
source: Node could not be published, probably because the parentNode does not exist in the current dimension. Please check that the parentNode has been published.
fi: Solmua ei voitu julkaista, koska vanhempisolmua ei ole olemassa nykyisessä dimensiossa. Tarkista, että parentNode on julkaistu.

# errorBoundary.technicalDetailsCopied
source: Technical details copied
fi: Tekniset yksityiskohdat kopioitu

# copyNodeTypeNameToClipboard
source: Copy node type to clipboard
fi: Kopioi solmun tyyppi leikepöydälle

# ckeditor__toolbar__link__formatOptions
source: Format options
fi: Muotovaihtoehdot

# UI.RightSideBar.tabs.validationErrorTooltip[0]
source: {tabName} – {amountOfErrors} validation issue
fi: {tabName} – {amountOfErrors} vahvistusongelma

# syncUriPathSegment
source: Syncronize with the title property
fi: Synkronoi otsikkoominaisuuden kanssa

source: nodes
fi: solmut

source: content elements selected
fi: sisältöelementit valittuina

# rangeEditorCurrentValue
source: Current value
fi: Nykyinen arvo

# errorBoundary.description
source: Please reload the application, or contact your system administrator with the given details.
fi: Lataa sovellus uudelleen tai ota yhteyttä järjestelmänvalvojaan annetuilla yksityistiedoilla.

source: Add
fi: Lisää

# ckeditor__toolbar__style__pre
source: Preformatted
fi: Esimuotoiltu

# UI.RightSideBar.tabs.validationErrorTooltip[1]
source: {tabName} – {amountOfErrors} validation issues
fi: {tabName} – {amountOfErrors} vahvistusongelmaa

# deleteXNodes
source: Delete {amount} nodes
fi: Poista {amount} solmua

source: Invalid value
fi: Virheellinen arvo

# switchedBaseWorkspace
source: Switched base workspace to "{workspace}".
fi: Vaihdettiin perustyötilaksi "{workspace}".

source: documents selected
fi: asiakirjat valittuina

# inspectorMutlipleContentNodesSelectedTooltip
source: Select a single document in order to be able to edit its properties
fi: Valitse yksi asiakirja, jotta voit muokata sen ominaisuuksia

# inspectorMutlipleDocumentNodesSelectedTooltip
source: Select a single content element in order to be able to edit its properties
fi: Valitse yksittäinen sisältöelementti, jotta voit muokata sen ominaisuuksia

# syncPersonalWorkSpace
source: Synchronize personal workspace
fi: Synkronoi henkilökohtainen työtila

# rangeEditorMinimum
source: Minimum
fi: Minimi

# rangeEditorMaximum
source: Maximum
fi: Maksimi

# errorBoundary.copyTechnicalDetails
source: Copy technical details
fi: Kopioi tekniset yksityiskohdat

# errorBoundary.footer
source: For more information about the error please refer to the JavaScript console.
fi: Lisätietoja virheestä on JavaScript-konsolissa.

source: Collapse All
fi: Supista kaikki
